---
kind: type
id: T:Autodesk.Revit.DB.Visual.Wave
source: html/9c0cc26f-f6ae-708e-5612-d3d181058174.htm
---
# Autodesk.Revit.DB.Visual.Wave

A static class that provides access to the property names that appear in the Wave visual asset schema.

## Syntax (C#)
```csharp
public static class Wave
```